yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/spi_reg.h
     * |        |          |Note: This bit will be cleared by writing 1 to it.
     * |[12]    |RXTOIF    |Receive Time-out Interrupt Flag
     * |        |          |0 = No receive FIFO time-out event.
     * |        |          |1 = Receive FIFO buffer is not empty and no read operation on receive FIFO buffer over 64 SPI peripheral clock periods in Master mode or over 576 SPI peripheral clock periods in Slave mode
     * |        |          |When the received FIFO buffer is read by software, the time-out status will be cleared automatically.
     * |        |          |Note: This bit will be cleared by writing 1 to it.
     * |[15]    |SPIENSTS  |SPI Enable Status (Read Only)
     * |        |          |0 = SPI controller Disabled.
     * |        |          |1 = SPI controller Enabled.
     * |        |          |Note: The SPI peripheral clock is asynchronous with the system clock
     * |        |          |In order to make sure the SPI control logic is disabled, this bit indicates the real status of SPI controller.
     * |[16]    |TXEMPTY   |Transmit FIFO Buffer Empty Indicator (Read Only)
     * |        |          |0 = Transmit FIFO buffer is not empty.
     * |        |          |1 = Transmit FIFO buffer is empty.
     * |[17]    |TXFULL    |Transmit FIFO Buffer Full Indicator (Read Only)
     * |        |          |0 = Transmit FIFO buffer is not full.
     * |        |          |1 = Transmit FIFO buffer is full.
     * |[18]    |TXTHIF    |Transmit FIFO Threshold Interrupt Flag (Read Only)
     * |        |          |0 = The valid data count within the transmit FIFO buffer is larger than the setting value of TXTH.
     * |        |          |1 = The valid data count within the transmit FIFO buffer is less than or equal to the setting value of TXTH.
     * |[19]    |TXUFIF    |TX Underflow Interrupt Flag
     * |        |          |When the TX underflow event occurs, this bit will be set to 1, the state of data output pin depends on the setting of TXUFPOL.
     * |        |          |0 = No effect.
     * |        |          |1 = No data in Transmit FIFO and TX shift register when the slave selection signal is active.
     * |        |          |Note 1: This bit will be cleared by writing 1 to it.
     * |        |          |Note 2: If reset slaveu2019s transmission circuit when slave selection signal is active, this flag will be set to 1 after 2 peripheral clock cycles + 3 system clock cycles since the reset operation is done.
     * |[23]    |TXRXRST   |TX or RX Reset Status (Read Only)
     * |        |          |0 = The reset function of TXRST or RXRST is done.
     * |        |          |1 = Doing the reset function of TXRST or RXRST.
     * |        |          |Note: Both the reset operations of TXRST and RXRST need 3 system clock cycles + 2 peripheral clock cycles
     * |        |          |User can check the status of this bit to monitor the reset function is doing or done.
     * |[27:24] |RXCNT     |Receive FIFO Data Count (Read Only)
     * |        |          |This bit field indicates the valid data count of receive FIFO buffer.
     * |[31:28] |TXCNT     |Transmit FIFO Data Count (Read Only)
     * |        |          |This bit field indicates the valid data count of transmit FIFO buffer.
     * @var SPI_T::STATUS2
     * Offset: 0x18  SPI Status2 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[29:24] |SLVBENUM  |Effective Bit Number of Uncompleted RX data
     * |        |          |This status register indicates that effective bit number of uncompleted RX data when SLVBERX (SPIx_FIFOCTL[10]) is enabled and RX bit count error event happen in SPI Slave mode.
     * |        |          |This status register will be fixed to 0x0 when SLVBERX (SPIx_FIFOCTL[10]) is disabled.
     * |        |          |Note: This register will be cleared to 0x0 when user writes 0x1 to SLVBEIF (SPIx_STATUS[6]) and SPI Slave mode Only
     * @var SPI_T::TX
     * Offset: 0x20  SPI Data Transmit Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |TX        |Data Transmit Register
     * |        |          |The data transmit registers pass through the transmitted data into the 4-level transmit FIFO buffers
     * |        |          |The number of valid bits depends on the setting of DWIDTH (SPIx_CTL[12:8]) in SPI mode or WDWIDTH (SPIx_I2SCTL[5:4]) in I2S mode.
     * |        |          |In SPI mode, if DWIDTH is set to 0x08, the bits TX[7:0] will be transmitted
     * |        |          |If DWIDTH is set to 0x00, the SPI controller will perform a 32-bit transfer.
     * |        |          |In I2S mode, if WDWIDTH (SPIx_I2SCTL[5:4]) is set to 0x2, the data width of audio channel is 24-bit and corresponding to TX[23:0]
     * |        |          |If WDWIDTH is set as 0x0, 0x1, or 0x3, all bits of this field are valid and referred to the data arrangement in I2S mode FIFO operation section
     * |        |          |Note: In Master mode, SPI controller will start to transfer the SPI bus clock after 1 APB clock and 6 peripheral clock cycles after user writes to this register.
     * @var SPI_T::RX
     * Offset: 0x30  SPI Data Receive Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |RX        |Data Receive Register (Read Only)
     * |        |          |There are 4-level FIFO buffers in this controller
     * |        |          |The data receive register holds the data received from SPI data input pin
     * |        |          |If the RXEMPTY (SPIx_STATUS[8] or SPIx_I2SSTS[8]) is not set to 1, the receive FIFO buffers can be accessed through software by reading this register.
     * @var SPI_T::INTERNAL
     * Offset: 0x48  SPI Internal Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3]     |DLATCH    |Data Latch Mode
     * |        |          |It is used to adjust the input data source in data received direction
     * |        |          |If the output clock delay by PAD and the system loading is less than half cycle of SPICLK in Master mode, the internal data shall be latched by the negative edge of SPI module clock to fix the data is available
     * |        |          |On the contrary, if the output clock delay is over than half cycle of SPICLK in Master mode, the internal data shall be latched by the positive edge of SPI module clock
     * |        |          |This bit is used to enable /disable the data latched cycle which is tuned by hardware circuit
     * |        |          |If the output clock delay is less than half cycle of SPICLK, there is active high signal in SPI internal hardware
     * |        |          |If the active high signal is fail, the user can set the DATMODE as 1 to force the latched data in the right cycle.
     * |        |          |Note: It is INTERNALOnly
     * |[7]     |SELFTEST  |Self-test Enable Bit
     * |        |          |0 = The self-test function Disabled.
     * |        |          |1 = Enable the self-test function. The Master received data will be the same as the transmit datum.
     * |[8]     |DEGOFF    |SPI Bus Clock Deglitch Circuit Disable Bit
     * |        |          |0 = The SPI bus clock Input deglitch circuit
     * |        |          |It can filter 1~2ns glitch on the SPI bus clock bus Enabled.
     * |        |          |1 = The SPI bus clock Input deglitch circuit Disabled.
     * |[11]    |MRXCLKS   |SPI Master Receiver Clock Source
     * |        |          |It is used to select the clock source of receive data sampled into RX skew buffer while SPI Master mode due to the system noise in serial clock bus.
     * |        |          |0 = Sample RX data by the Master feedback SPI_CLK (Chip PAD-out loopback to PAD-in).
     * |        |          |1 = Sample RX data latter the 0.0 period of sending SPI_CLK.
     * |        |          |Note: It is use in MRXPHASE = 4u2019h0 only.
     * |[15:12] |MRXPHASE  |SPI Master Receive Phase Selection
     * |        |          |It is used to adjust the timing of receive data sampled into RX skew buffer while SPI Master mode due to the PAD I/O latency (send SPI_CLK to Slave device through the output pin and then wait the receive data from Slave device through the input pin)
     * |        |          |0x0: Sample RX data by the Master feedback SPI_CLK (Chip PAD-out loopback to PAD-in)
     * |        |          |0x1: Sample RX data latter the 0.5 period of sending SPI_CLK
     * |        |          |0x2: Sample RX data latter the 1 period of sending SPI_CLK
     * |        |          |0x3: Sample RX data latter the 1.5 period of sending SPI_CLK
     * |        |          |0x4: Sample RX data latter the 2 periods of sending SPI_CLK
     * |        |          |u2026
     * |        |          |0xb: Sample RX data latter the 5.5 periods of sending SPI_CLKOthers are reserved.
     * |        |          |Others are reserved.
     * |        |          |Note: It is INTERNALOnly
     * |[19:16] |RXRP      |RX FIFO Read Pointer
     * |        |          |Note: It is INTERNAL and Read Only.
     * |[23:20] |RXWP      |RX FIFO Write Pointer
     * |        |          |Note: It is INTERNAL and Read Only.
     * |[27:24] |TXRP      |TX FIFO Read Pointer
     * |        |          |Note: It is INTERNAL and Read Only.
     * |[31:28] |TXWP      |TX FIFO Write Pointer
     * |        |          |Note: It is INTERNAL and Read Only.
     * @var SPI_T::VERSION
     * Offset: 0xFFC  SPI Version Number Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |MINOR     |Minor Version Number
     * |        |          |Minor version number is dependent on ECO version control
     * |        |          |0x0000: (current Minor Version Number)
     * |[23:16] |SUB       |Sub Version Number
     * |        |          |Sub version number is relative to key feature
     * |        |          |0x02: (current Sub Version Number)
     * |[31:24] |MAJOR     |Major Version Number
     * |        |          |Major version number is correlated to Product Line
     * |        |          |0x02: (current Major Version Number)
     */
    __IO uint32_t CTL;                   /*!< [0x0000] SPI Control Register                                             */
    __IO uint32_t CLKDIV;                /*!< [0x0004] SPI Clock Divider Register                                       */
    __IO uint32_t SSCTL;                 /*!< [0x0008] SPI Slave Select Control Register                                */
    __IO uint32_t PDMACTL;               /*!< [0x000c] SPI PDMA Control Register                                        */
    __IO uint32_t FIFOCTL;               /*!< [0x0010] SPI FIFO Control Register                                        */
    __IO uint32_t STATUS;                /*!< [0x0014] SPI Status Register                                              */
    __I  uint32_t STATUS2;               /*!< [0x0018] SPI Status2 Register                                             */
    __I  uint32_t RESERVE0[1];
    __O  uint32_t TX;                    /*!< [0x0020] SPI Data Transmit Register                                       */
    __I  uint32_t RESERVE1[3];
    __I  uint32_t RX;                    /*!< [0x0030] SPI Data Receive Register                                        */
    __I  uint32_t RESERVE2[5];
    __IO uint32_t INTERNAL;              /*!< [0x0048] SPI Internal Control Register                                    */
    __I  uint32_t RESERVE3[1004];
    __I  uint32_t VERSION;               /*!< [0x0ffc] SPI Version Number Register                                      */

