yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/spi_reg.h
#define SPI_STATUS_RXTHIF_Pos            (10)                                              /*!< SPI_T::STATUS: RXTHIF Position         */
#define SPI_STATUS_RXTHIF_Msk            (0x1ul << SPI_STATUS_RXTHIF_Pos)                  /*!< SPI_T::STATUS: RXTHIF Mask             */

#define SPI_STATUS_RXOVIF_Pos            (11)                                              /*!< SPI_T::STATUS: RXOVIF Position         */
#define SPI_STATUS_RXOVIF_Msk            (0x1ul << SPI_STATUS_RXOVIF_Pos)                  /*!< SPI_T::STATUS: RXOVIF Mask             */

#define SPI_STATUS_RXTOIF_Pos            (12)                                              /*!< SPI_T::STATUS: RXTOIF Position         */
#define SPI_STATUS_RXTOIF_Msk            (0x1ul << SPI_STATUS_RXTOIF_Pos)                  /*!< SPI_T::STATUS: RXTOIF Mask             */

#define SPI_STATUS_SPIENSTS_Pos          (15)                                              /*!< SPI_T::STATUS: SPIENSTS Position       */
#define SPI_STATUS_SPIENSTS_Msk          (0x1ul << SPI_STATUS_SPIENSTS_Pos)                /*!< SPI_T::STATUS: SPIENSTS Mask           */

#define SPI_STATUS_TXEMPTY_Pos           (16)                                              /*!< SPI_T::STATUS: TXEMPTY Position        */
#define SPI_STATUS_TXEMPTY_Msk           (0x1ul << SPI_STATUS_TXEMPTY_Pos)                 /*!< SPI_T::STATUS: TXEMPTY Mask            */

#define SPI_STATUS_TXFULL_Pos            (17)                                              /*!< SPI_T::STATUS: TXFULL Position         */
#define SPI_STATUS_TXFULL_Msk            (0x1ul << SPI_STATUS_TXFULL_Pos)                  /*!< SPI_T::STATUS: TXFULL Mask             */

#define SPI_STATUS_TXTHIF_Pos            (18)                                              /*!< SPI_T::STATUS: TXTHIF Position         */
#define SPI_STATUS_TXTHIF_Msk            (0x1ul << SPI_STATUS_TXTHIF_Pos)                  /*!< SPI_T::STATUS: TXTHIF Mask             */

#define SPI_STATUS_TXUFIF_Pos            (19)                                              /*!< SPI_T::STATUS: TXUFIF Position         */
#define SPI_STATUS_TXUFIF_Msk            (0x1ul << SPI_STATUS_TXUFIF_Pos)                  /*!< SPI_T::STATUS: TXUFIF Mask             */

#define SPI_STATUS_TXRXRST_Pos           (23)                                              /*!< SPI_T::STATUS: TXRXRST Position        */
#define SPI_STATUS_TXRXRST_Msk           (0x1ul << SPI_STATUS_TXRXRST_Pos)                 /*!< SPI_T::STATUS: TXRXRST Mask            */

#define SPI_STATUS_RXCNT_Pos             (24)                                              /*!< SPI_T::STATUS: RXCNT Position          */
#define SPI_STATUS_RXCNT_Msk             (0xful << SPI_STATUS_RXCNT_Pos)                   /*!< SPI_T::STATUS: RXCNT Mask              */

#define SPI_STATUS_TXCNT_Pos             (28)                                              /*!< SPI_T::STATUS: TXCNT Position          */
#define SPI_STATUS_TXCNT_Msk             (0xful << SPI_STATUS_TXCNT_Pos)                   /*!< SPI_T::STATUS: TXCNT Mask              */

#define SPI_STATUS2_SLVBENUM_Pos         (24)                                              /*!< SPI_T::STATUS2: SLVBENUM Position      */
#define SPI_STATUS2_SLVBENUM_Msk         (0x3ful << SPI_STATUS2_SLVBENUM_Pos)              /*!< SPI_T::STATUS2: SLVBENUM Mask          */

#define SPI_TX_TX_Pos                    (0)                                               /*!< SPI_T::TX: TX Position                 */
#define SPI_TX_TX_Msk                    (0xfffffffful << SPI_TX_TX_Pos)                   /*!< SPI_T::TX: TX Mask                     */

#define SPI_RX_RX_Pos                    (0)                                               /*!< SPI_T::RX: RX Position                 */
#define SPI_RX_RX_Msk                    (0xfffffffful << SPI_RX_RX_Pos)                   /*!< SPI_T::RX: RX Mask                     */

#define SPI_INTERNAL_DLATCH_Pos          (3)                                               /*!< SPI_T::INTERNAL: DLATCH Position       */
#define SPI_INTERNAL_DLATCH_Msk          (0x1ul << SPI_INTERNAL_DLATCH_Pos)                /*!< SPI_T::INTERNAL: DLATCH Mask           */

#define SPI_INTERNAL_SELFTEST_Pos        (7)                                               /*!< SPI_T::INTERNAL: SELFTEST Position     */
#define SPI_INTERNAL_SELFTEST_Msk        (0x1ul << SPI_INTERNAL_SELFTEST_Pos)              /*!< SPI_T::INTERNAL: SELFTEST Mask         */

#define SPI_INTERNAL_DEGOFF_Pos          (8)                                               /*!< SPI_T::INTERNAL: DEGOFF Position       */
#define SPI_INTERNAL_DEGOFF_Msk          (0x1ul << SPI_INTERNAL_DEGOFF_Pos)                /*!< SPI_T::INTERNAL: DEGOFF Mask           */

#define SPI_INTERNAL_MRXCLKS_Pos         (11)                                              /*!< SPI_T::INTERNAL: MRXCLKS Position      */
#define SPI_INTERNAL_MRXCLKS_Msk         (0x1ul << SPI_INTERNAL_MRXCLKS_Pos)               /*!< SPI_T::INTERNAL: MRXCLKS Mask          */

#define SPI_INTERNAL_MRXPHASE_Pos        (12)                                              /*!< SPI_T::INTERNAL: MRXPHASE Position     */
#define SPI_INTERNAL_MRXPHASE_Msk        (0xful << SPI_INTERNAL_MRXPHASE_Pos)              /*!< SPI_T::INTERNAL: MRXPHASE Mask         */

#define SPI_INTERNAL_RXRP_Pos            (16)                                              /*!< SPI_T::INTERNAL: RXRP Position         */
#define SPI_INTERNAL_RXRP_Msk            (0xful << SPI_INTERNAL_RXRP_Pos)                  /*!< SPI_T::INTERNAL: RXRP Mask             */

#define SPI_INTERNAL_RXWP_Pos            (20)                                              /*!< SPI_T::INTERNAL: RXWP Position         */
#define SPI_INTERNAL_RXWP_Msk            (0xful << SPI_INTERNAL_RXWP_Pos)                  /*!< SPI_T::INTERNAL: RXWP Mask             */

#define SPI_INTERNAL_TXRP_Pos            (24)                                              /*!< SPI_T::INTERNAL: TXRP Position         */
#define SPI_INTERNAL_TXRP_Msk            (0xful << SPI_INTERNAL_TXRP_Pos)                  /*!< SPI_T::INTERNAL: TXRP Mask             */

#define SPI_INTERNAL_TXWP_Pos            (28)                                              /*!< SPI_T::INTERNAL: TXWP Position         */
#define SPI_INTERNAL_TXWP_Msk            (0xful << SPI_INTERNAL_TXWP_Pos)                  /*!< SPI_T::INTERNAL: TXWP Mask             */

#define SPI_VERSION_MINOR_Pos            (0)                                               /*!< SPI_T::VERSION: MINOR Position         */
#define SPI_VERSION_MINOR_Msk            (0xfffful << SPI_VERSION_MINOR_Pos)               /*!< SPI_T::VERSION: MINOR Mask             */

#define SPI_VERSION_SUB_Pos              (16)                                              /*!< SPI_T::VERSION: SUB Position           */
#define SPI_VERSION_SUB_Msk              (0xfful << SPI_VERSION_SUB_Pos)                   /*!< SPI_T::VERSION: SUB Mask               */

#define SPI_VERSION_MAJOR_Pos            (24)                                              /*!< SPI_T::VERSION: MAJOR Position         */
#define SPI_VERSION_MAJOR_Msk            (0xfful << SPI_VERSION_MAJOR_Pos)                 /*!< SPI_T::VERSION: MAJOR Mask             */

/**@}*/ /* SPI_CONST */
/**@}*/ /* end of SPI register group */

/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __SPI_REG_H__ */